#-------------------------------------------------------------------------------
# Name:        module1
# Purpose:
#
# Author:      isdobnikov
#
# Created:     26.02.2019
# Copyright:   (c) isdobnikov 2019
# Licence:     <your licence>
#-------------------------------------------------------------------------------
#
# Задача-3:
# Дан произвольный список из целых чисел.
# Получите НОВЫЙ список из элементов исходного, выполнив следующие условия:
# если элемент кратен двум, то разделить его на 4, если не кратен, то умножить на два.

arr_list = [1, 4, 3, 42, 48, 34, 4, 5, 10, 7, 8, 9]
arr = []
print(arr_list)
for i in arr_list:
    if i % 2 == 0:
        arr.append(int(i / 4))
    else:
        arr.append(i * 2)
print(arr)